# Dotfiles Brewfile
# Install with: brew bundle

# Taps
tap "homebrew/bundle"

# CLI Tools
brew "bat"           # Better cat
brew "eza"           # Better ls
brew "fzf"           # Fuzzy finder
brew "zoxide"        # Smart cd
brew "ripgrep"       # Better grep
brew "fd"            # Better find
brew "neovim"        # Editor
brew "stow"          # Dotfiles symlink manager
brew "git"           # Version control
brew "gh"            # GitHub CLI
brew "git-delta"     # Better git diffs
brew "coreutils"     # GNU core utilities (gdate, etc.)
brew "fswatch"       # File change monitor
brew "gnupg"         # GPG for commit signing

# Shell
brew "zsh"
brew "spaceship"                      # Spaceship prompt
brew "zsh-history-substring-search"   # Better history search (fixes cursor issues in tmux)

# Development
brew "fnm"           # Fast Node Manager (manages Node versions)
brew "go"            # Go language
brew "bun"           # Fast JS/TS runtime for CLI tools

# Optional - uncomment if needed
# brew "tmux"        # Terminal multiplexer
# brew "jq"          # JSON processor
# brew "htop"        # Process viewer
# brew "wget"        # Download tool
# brew "tree"        # Directory tree view

# Fonts (required for terminal/editor)
cask "font-jetbrains-mono-nerd-font"  # Used by Ghostty and p10k

# Casks (GUI apps)
cask "ghostty"           # Terminal emulator
# cask "iterm2"
# cask "visual-studio-code"
# cask "cursor"
